<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<%@include file="header.jsp"%>
<%@include file="tap.jsp"%>
<html>
<head>
    <title>Title</title>
</head>
<body>
<div class="log">
    <h4>소프트웨어공학과</h4>
    <h4>18학번 이후의 졸업요건 </h4>
    <div class="ch" id="chart_div"></div>
</div>
*졸업 학점이 130학점이상이여야 한다.
-1학년 : 34학점 이상
-2학년 : 68학점 이상
-3학년 : 102학점 이상
-4학년 : 130학점 이상

---------------------------------------------------------------------------------------------------------------------------
*교과 과정
-교양 과정(필수)  ->열림교양대학이 개설하는 교과목
-전공탐색과정(필수) ->각 융합자율학부 또는 전공 이 개설하는 교과목
-전공 과정(필수) -> 각 전공이 개설하는 교과목
-특별 과정(선택) -> 복수 전공 or  부전공으로 인정하는 과목
-> 세부 사항은 교과 과정에 관한 시행세칙에서 정함.

---------------------------------------------------------------------------------------------------------------------------

*졸업 요건
- 졸업학점 130학점 이상을 이수한 자
- 비아메디아 채플 이수기준을 충족한 자
- 사회봉사 이수기준을 충족한 자. 다만, 장애학생의 경우 사회봉사 이수가 곤란하다고 판단될 시, 총장은 이에 대한 이수를 면제할 수 있다.
- 교양필수, 전공필수 과목을 모두 이수한 자
- 다음 전공 이수방식 중 하나를 선택하여 각 전공에서 요구하는 졸업자격을 충족한 자
- 주전공과 부전공
- 복수1전공과 복수2전공
- 혁신융합전공
- 특별과정을 신청한 경우, 그 이수기준을 충족한 자
- 전공탐색 이수학점을 충족한 자

---------------------------------------------------------------------------------------------------------------------------

1.교과 과정 세부 LIST

1-1 교양 과정(최소 34학점 교양 과목 이수 해야함)
-핵심 역량 교양
-과목 지정 필수(총 16학점 이수 해야함)
-인권과 평화 2학점(1과목)
-대학생활 세미나1  2학점(1과목)
-대학생활 세미나2  2학점(1과목)
-말과 글 2학점(1과목)
-사회봉사1  2학점(1과목)
- 비아메디아 채플 2학점(1과목) -> 재학중 2학기 동안 2과목 이수해야함
-과학기술과 에콜로지 2학점(1과목)
-데이터 활용 및 분석 2학점(1과목)

-영역 지정 필수(총 18학점 이수해야함 -> 핵심 역량 내 2개 이상의 영역에서 이수)
-가치 역량(6학점 -> 2과목)
-인간⊙인권
-생명⊙평화
-민주시민

-대안 역량(6학점 -> 2과목)
-융복합적 사고
-조사⊙분석⊙정보활용
-대안제시⊙문제해결
-실천 역량(6학점 -> 2과목)
-민주적 소통
-연대와 공동체적 실천

-자기 계발 교양 (어떤 과목을 이야기 하는거지?)

1-2.전공 과정
-세가지 중 하나 선택
-주(40) + 부(20)
-복(40) +복(20)
-혁신융합전공(60)

1-3.전공 탐색 과정(19학점 이상 이수해야함 -> 전공탐색세미나 포함)
-3학점 (소속 융합 자율 학부 이외의 융합 자율 학부에서 개설한 전공탐색 과목 이수)
-전공탐색 과정의 교과목들
-c프로그래밍
-python
-웹 개발 입문
-등등….여러가지 있음

1-4.특별 과정
-전공 기초 과정
-전공 심화 과정
-복수 전공 과정 (두 학기 수료 후 신청 가능 -> 신청이 가능한 자는 취득학점이 34학점
  이상  ->  이수자는 전공학점 40학점 이상 취득해야함 -> 취소 할 경우 교양선택 학점으로 인정)

-부 전공 과정(두 학기 수료 후 신청 가능 -> 신청이 가능한 자는 취득학점이 34학점
  이상 -> 이수자는 교과 과정에 따라 21학점 취득해야함 -> 취소 할 경우 교양선택 학점으로 인정)

-연계 전공 과정(두 개 이상의 학과의 전공과정과 교양과정을 연계하는 과정이다.)
(신청하고자 하는 사람은 연계 전공 신청서를 제출하고 승인 받아야함)
(두 학기 수료 후 신청 가능 -> 신청이 가능한 자는 취득학점이 34학점 이상 -> 이수자는 연계전공학점 40학점 이상 취득 해야 함)
-평생 교육사 과정
-교직 과정
-해외창 과정
-자기 설계 과정
-부전공 또는 복수 전공을 대체할 수 있음



</body>
</html>
